import React, { useState } from "react";
import Faq from "./Faq";

const FaqSection = () => {
  const [questions, setQuestions] = useState([
    {
      id: 1,
      question: "ပုဂံခေတ်",
      answer: "ပျူလူမျိုးတွေနဲ့ ဗမာလူမျိုးတွေရဲ့ ရောစပ်မှုနဲ့ ပုဂံနိုင်ငံတည်ထောင်ခြင်းသီရိဓမ္မာသောကမင်းကြီးရဲ့ ထေရဝါဒဗုဒ္ဓသာသနာကို မြန်မာနိုင်ငံကို ပြန့်ပွားစေခြင်းပုဂံခေတ်ဟာ မြန်မာ့ယဉ်ကျေးမှု၊ ဘာသာစကား၊ စာပေ စတာတွေရဲ့ အခြေခံကို ပေးခဲ့တဲ့ခေတ်ဖြစ်ပါတယ်။",
    },
    {
      id: 2,
      question: "မွန်-ဗမာစစ်ပွဲများ",
      answer:
        "မွန်လူမျိုးတွေနဲ့ ဗမာလူမျိုးတွေကြား အာဏာအတွက် စစ်ပွဲတွေ ဖြစ်ပွားခဲ့ခြင်း ဒီစစ်ပွဲတွေက မြန်မာနိုင်ငံရဲ့ နိုင်ငံရေး အခြေအနေကို လွှမ်းမိုးခဲ့ပါတယ်။",
    },
    {
      id: 3,
      question: "တောင်ငူခေတ်",
      answer:
        "တောင်ငူမင်းဆက်က မြန်မာနိုင်ငံကို ပြန်လည်စည်းလုံးခဲ့ခြင်း အရှေ့တောင်အာရှဒေသမှာ အင်အားကြီးတဲ့ အင်ပါယာတစ်ခု ဖြစ်လာခဲ့ခြင်း",
    },
    {
      id: 4,
      question: "ကုန်းဘောင်ခေတ် ",
      answer:
        "ကုန်းဘောင်မင်းဆက်က တောင်ငူခေတ်က စတင်ခဲ့တဲ့ ပြုပြင်ပြောင်းလဲမှုတွေကို ဆက်လက်လုပ်ဆောင်ခဲ့ခြင်း အိမ်နီးချင်းနိုင်ငံတွေနဲ့ စစ်ပွဲတွေ ဖြစ်ပွားခဲ့ခြင်း",
    },
    {
      id: 5,
      question: "ဗြိတိသျှကိုလိုနီခေတ်",
      answer:
        "အင်္ဂလိပ်-မြန်မာစစ်ပွဲတွေကြောင့် မြန်မာနိုင်ငံက ဗြိတိသျှကိုလိုနီအောက်သို့ ကျရောက်ခဲ့ခြင်း မြန်မာ့ယဉ်ကျေးမှု၊ စီးပွားရေး၊ နိုင်ငံရေးတွေမှာ အကြီးအကျယ် ပြောင်းလဲမှုတွေ ဖြစ်ပေါ်ခဲ့ခြင်း",
    },

    {
      id: 6,
      question: "လွတ်လပ်ရေး ",
      answer:
        "မြန်မာနိုင်ငံက ဗြိတိသျှကိုလိုနီအောက်ကနေ လွတ်လပ်ရေးရခဲ့ခြင်း ဒီဖြစ်ရပ်က မြန်မာ့သမိုင်းမှာ အရေးကြီးဆုံးဖြစ်ရပ်တစ်ခုအဖြစ် သတ်မှတ်နိုင်ပါတယ်။",
    },
  ]);

  const toggleQuestion = (id) => {
    setQuestions(
      questions.map((el) =>
        el.id === id ? { ...el, isOpen: !el.isOpen } : { ...el, isOpen: false }
      )
    );
  };

  return (
    <div className="p-10">
      <h2 className="text-4xl font-bold mb-3">
       Myanmar Frequently Questions
      </h2>
      <div className="flex flex-col">
        {questions.map((question) => (
          <Faq
            toggleQuestion={toggleQuestion}
            key={question.id}
            faq={question}
          />
        ))}
      </div>
    </div>
  );
};

export default FaqSection;
